modules/admin/controllers/ImportController.php

    public function actionCreate()
    {
        $model = new ImportProducts();

        if ($model->load(Yii::$app->request->post())) {
            $dirStorage = Yii::getAlias('@webroot') . '/import/';
            $file = UploadedFile::getInstance($model, 'filename');

            if(isset($file) && $file != "") {
                $model->filename = $model->uploadXml($file, $dirStorage);
                $model->save();
---
INSERT INTO `import_products` (`filename`, `created_at`, `updated_at`, `user_id`) VALUES ('504956a8aee335a4e6.99873713.xml', NOW(), NOW(), 1)