modules/admin/models/ImportProducts.php

DELETE FROM `products`
---
    protected function parseAndSaveData($reader)
    {
        Products::deleteAll();

INSERT INTO `products` (`mnn`, `tn`, `kpr`, `nshort3`, `namepr`, `country`, `otd`, `osnls`, `tender`, `spar`, `goden_do`, `cenopt`, `cenrozn`, `kol`, `tendergod`, `vidtovara`, `obnalichie`, `kolotgr`, `vidpost`, `kodpart`) VALUES ('Адониса экстракт+Калия бромид', 'Адонис-бром', '0210030', 'таблетки п/о упаковка №30', 'Борисовский завод медпрепаратов Борисов Беларусь', 'Беларусь', 5, 0, 0, '3070515', '2017-06-01T00:00:00', 9917, 13000, 65, NULL, 'ЛС', 0, 70, 'Обычная поставка', '359821')
---
                    }

                }
                if($product->save()) {