modules/admin/models/OrdersHandler.php

SELECT * FROM `user` WHERE `id`=82
---
    public function getContragentName()
    {
        $user = User::findOne($this->user_id);

SELECT * FROM `user` WHERE `id`=82
---
    public function getContragentCod()
    {
        $user = User::findOne($this->user_id);