modules/user/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `user` WHERE `username`='test'