mail.pharma.by/modules/main/models/Orders.php

    public function createDbf()
    {
        $localFolder = Yii::getAlias('@webroot') . '/export/';
        $orderedProducts = OrderedProduct::findAll(['order_id' => $this->id]);
        $contragentCod = User::findOne($this->user_id)->cod;
---
SELECT * FROM `user` WHERE `id`=133

    protected function sendToFtpServer($remoteFilename, $localFilename)
    {
        //$host='mail.pharma.by';
        $host=  Settings::findOne(['key' => 'ftp-host'])->value;
        $login=Settings::findOne(['key' => 'ftp-login'])->value;
        $password=Settings::findOne(['key' => 'ftp-password'])->value;
        $remoteFolder = Settings::findOne(['key' => 'ftp-folder-in'])->value . '/';
---
SELECT * FROM `settings` WHERE `key`='ftp-host'
SELECT * FROM `settings` WHERE `key`='ftp-login'
SELECT * FROM `settings` WHERE `key`='ftp-password'
SELECT * FROM `settings` WHERE `key`='ftp-folder-in'