modules/main/models/Orders.php

    public static function createNewOrder($event)
    {
        $session = Yii::$app->session;
        if(Yii::$app->session->get('creatingOrder') == 1)
        {
            $event->orderedProduct->order_id = $session->get('idOrder');
            $session->set('countOrderedProducts', OrderedProduct::find()->countOrdered()+1);
        } else {
            $order = self::createInstanceByAgent();
            if($order->save())
---
INSERT INTO `orders` (`status`, `user_id`, `changed`, `repeated`, `count_repeat`, `buggod`, `created_at`, `updated_at`) VALUES (0, 5, 0, 0, 0, 1, NOW(), NOW())