modules/main/models/OrderedProductQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `ordered_product` WHERE `order_id` IS NULL

    public function countOrdered()
    {
        return $this->whereOrderId()->count();
---
SELECT COUNT(*) FROM `ordered_product` WHERE `order_id` IS NULL

    public function countProductsForOrder($id)
    {
        return parent::where(['order_id' => $id])->count();
---
SELECT COUNT(*) FROM `ordered_product` WHERE `order_id`=1452