mail.pharma.by/modules/main/controllers/OrderedproductController.php

    public function actionAddToProduct($id)
    {
        $product = Products::findOne(['kpr' => $id]);
        $model = OrderedProduct::findOne([
            'kpr' => $id,
            'user_id' => Yii::$app->user->getId(),
            'order_id' => Yii::$app->session->get('idOrder')
            ]);
        if(empty($model)) {
            $model = new OrderedProduct();
            $model->kpr = $product->kpr;
            $model->imn = $product->tn;
            $model->otd = $product->otd;
            $model->dsv = $product->namepr;
            $model->user_id = Yii::$app->user->getId();
            $model->buggod = true;
        }
        $event = new OrderEvent();
        $event->orderedProduct = $model;
        $model->on(self::EVENT_ADD_PRODUCT_TO_ORDER, ['app\modules\main\models\Orders', 'createNewOrder']);

        if (Yii::$app->request->isPost) {
            $post = Yii::$app->request->post();
            $model->kolz = (int)$post['kol'];
            $model->trigger(self::EVENT_ADD_PRODUCT_TO_ORDER, $event);
            if($model->save())
---
INSERT INTO `ordered_product` (`kpr`, `imn`, `otd`, `dsv`, `user_id`, `buggod`, `kolz`, `order_id`) VALUES ('7046321', 'Термометр электронный \"Интеграл\"', 1, 'Филиал Завод Электроника Минск Беларусь', 133, 1, 14, 641)

    public function actionCheckout()
    {
        $totalPrice = OrdersQuery::totalPrice();
        $order = Orders::findOne(Yii::$app->session->get('idOrder'));
        $searchModel = new OrderedProductSearch();
        $dataProvider = $searchModel->searchAttachToOrder(Yii::$app->request->queryParams);
        $validOrder = true;
        $orderedProducts = $dataProvider->models;
        foreach($orderedProducts as $orderdedProduct) {
            if(!$orderdedProduct->isProduct) {
                $validOrder = false;
            }
        }
        if($dataProvider->count < $dataProvider->totalCount) {
            $validOrder = false;
        }
        if(isset($order) && $order->load(Yii::$app->request->post()) && $order->save()) {
---
UPDATE `orders` SET `updated_at`=NOW(), `buggod`=0 WHERE `id`=641

    public function actionSendOrder($id)
    {
        $session = Yii::$app->session;
        $order = Orders::findOne(['id' => $id]);
        $order->status = Orders::STATUS_SENDED;
        $order->save();
---
UPDATE `orders` SET `status`=1, `updated_at`=NOW() WHERE `id`=641