modules/main/controllers/OrderedproductController.php

    public function actionAddToProduct($id)
    {
        $product = Products::findOne(['kodpart' => $id]);
        $model = OrderedProduct::findOne([
            'kodpart' => $id,
            'user_id' => Yii::$app->user->getId(),
            'order_id' => Yii::$app->session->get('idOrder')
            ]);
        if(empty($model)) {
            $model = new OrderedProduct();
            $model->kodpart = $product->kodpart;
            $model->kpr = $product->kpr;
            $model->imn = $product->tn;
            $model->otd = $product->otd;
            $model->dsv = $product->namepr;
            $model->user_id = Yii::$app->user->getId();
            $model->buggod = true;
        }
        $event = new OrderEvent();
        $event->orderedProduct = $model;
        $model->on(self::EVENT_ADD_PRODUCT_TO_ORDER, ['app\modules\main\models\Orders', 'createNewOrder']);
        if (Yii::$app->request->isPost) {
            $post = Yii::$app->request->post();
            $model->kolz = substr(str_replace(',','.',$post['kol']),0,5);
            $model->trigger(self::EVENT_ADD_PRODUCT_TO_ORDER, $event);
            if($model->save())
---
INSERT INTO `ordered_product` (`kodpart`, `kpr`, `imn`, `otd`, `dsv`, `user_id`, `buggod`, `kolz`, `order_id`) VALUES ('395560', '7054052', 'B-комплекс БАД', 3, 'Aconitum Z.o.o.  Литва', 5, 1, 1.4, 1529)