modules/main/controllers/ProductsController.php

SELECT * FROM `countries`
---
    public function actionIndex()
    {
        $searchModel = new ProductsSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $countries = Countries::find()->all();